Beberapa hal yang akan dilakukan:
1. Pivoting table
2. Pivoting table, dengan kondisi data duplicate

In [1]:
import pandas as pd

In [2]:
penjualan = {
    'toko': ['Bandung', 'Garut', 'Jakarta', 'Garut', 'Bandung', 'Jakarta'],
    'Barang': ['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil': [200000, 300000, 150000, 100000, 120000, 400000]
}

In [3]:
df = pd.DataFrame(penjualan)

In [4]:
df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3    Garut  Minyak  100000
4  Bandung  Minyak  120000
5  Jakarta  Minyak  400000

In [7]:
df.pivot_table(index='toko', columns='Barang', values='Hasil')

Barang   Minyak   Telur
toko
Bandung  120000  200000
Garut    100000  300000
Jakarta  400000  150000

In [8]:
penjualan2 = {
    'toko': ['Bandung', 'Garut', 'Jakarta', 'Garut', 'Bandung', 'Jakarta'],
    'Barang': ['Telur', 'Telur', 'Telur', 'Minyak', 'Minyak', 'Minyak'],
    'Hasil': [240000, 320000, 200000, 300000, 150000, 200000]
}

In [9]:
df2 = pd.DataFrame(penjualan2)

In [10]:
df2

      toko  Barang   Hasil
0  Bandung   Telur  240000
1    Garut   Telur  320000
2  Jakarta   Telur  200000
3    Garut  Minyak  300000
4  Bandung  Minyak  150000
5  Jakarta  Minyak  200000

In [13]:
df_gabung = df.append(df2, ignore_index=True)

In [14]:
df_gabung

       toko  Barang   Hasil
0   Bandung   Telur  200000
1     Garut   Telur  300000
2   Jakarta   Telur  150000
3     Garut  Minyak  100000
4   Bandung  Minyak  120000
5   Jakarta  Minyak  400000
6   Bandung   Telur  240000
7     Garut   Telur  320000
8   Jakarta   Telur  200000
9     Garut  Minyak  300000
10  Bandung  Minyak  150000
11  Jakarta  Minyak  200000

In [15]:
# untuk data yang memiliki index yang sama, maka akan di-aggregate oleh pivot table
# disini hasil aggregatenya dilakukan secara default dengan fungsi aggregate-nya 'mean' atau rata-rata
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil')

Barang   Minyak   Telur
toko
Bandung  135000  220000
Garut    200000  310000
Jakarta  300000  175000

In [17]:
# disini hasil aggregatenya dilakukan secara menjumlahkan atau 'sum'
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil', aggfunc='sum')

Barang   Minyak   Telur
toko
Bandung  270000  440000
Garut    400000  620000
Jakarta  600000  350000